[
    {
        "question_text": "What is Python?",
        "student_answer": "Python is a popular programming language used in AI and web development.",
        "sample_answers": [
            "Python is a high-level, versatile programming language used for web development, data science, and automation.",
            "Python is a widely-used programming language known for its simplicity and applications in AI."
        ],
        "expected_score": 0.95
    },
    {
        "question_text": "Explain what a loop is in programming.",
        "student_answer": "A loop repeats code while a condition is true.",
        "sample_answers": [
            "A loop is a programming construct that repeats a block of code until a condition is met.",
            "A loop allows code to be executed repeatedly based on a condition."
        ],
        "expected_score": 0.90
    },
    {
        "question_text": "Define variable in programming.",
        "student_answer": "Variable is something that keeps data.",
        "sample_answers": [
            "A variable is a symbolic name used to store data values.",
            "A variable holds data that can be modified during program execution."
        ],
        "expected_score": 0.80
    },
    {
        "question_text": "What is artificial intelligence?",
        "student_answer": "AI is when machines act smart.",
        "sample_answers": [
            "Artificial intelligence is the simulation of human intelligence in machines.",
            "AI enables machines to perform tasks that require human-like intelligence."
        ],
        "expected_score": 0.75
    },
    {
        "question_text": "What is the purpose of an algorithm?",
        "student_answer": "An algorithm solves problems step by step.",
        "sample_answers": [
            "An algorithm is a step-by-step procedure used to perform a specific task or solve a problem.",
            "An algorithm provides a structured approach to problem-solving in programming."
        ],
        "expected_score": 1.0
    },
    {
        "question_text": "What does IDE stand for?",
        "student_answer": "It stands for Integrated Development Environment.",
        "sample_answers": [
            "IDE stands for Integrated Development Environment, a software suite that helps programmers write code efficiently.",
            "An IDE is a toolset for coding, debugging, and testing software."
        ],
        "expected_score": 0.85
    },
    {
        "question_text": "Explain inheritance in object-oriented programming.",
        "student_answer": "Inheritance means a class can use features of another class.",
        "sample_answers": [
            "Inheritance is an OOP concept where a class (child) derives properties and behaviors from another class (parent).",
            "Inheritance allows a class to inherit attributes and methods from a parent class."
        ],
        "expected_score": 0.90
    },
    {
        "question_text": "What is recursion?",
        "student_answer": "When a function calls itself.",
        "sample_answers": [
            "Recursion is a programming technique where a function calls itself to solve a problem.",
            "Recursion involves a function invoking itself with modified parameters."
        ],
        "expected_score": 0.95
    },
    {
        "question_text": "What is the function of a compiler?",
        "student_answer": "Compiler turns code into machine language.",
        "sample_answers": [
            "A compiler is a program that translates source code into executable machine code.",
            "A compiler converts high-level code into a format the computer can execute."
        ],
        "expected_score": 1.0
    },
    {
        "question_text": "What is a data structure?",
        "student_answer": "It organizes data in computer memory.",
        "sample_answers": [
            "A data structure is a specialized format for organizing, processing, and storing data.",
            "A data structure is a way to store and manage data efficiently in a program."
        ],
        "expected_score": 0.90
    }
]